In [1]:
import pandas as pd

## Series
---

In [2]:
series_test = pd.Series([100, 200, 300])
series_test

0    100
1    200
2    300
dtype: int64

In [10]:
series_test2 = pd.Series({1999:48, 200:65, 2000:89})
series_test2

1999    48
200     65
2000    89
dtype: int64

## DataFrames
---

In [12]:
frame_test = pd.DataFrame({1999:[10, 11, 12], 2000:[13, 14, 15], 2001:[16, 17, 18]})
frame_test

   1999  2000  2001
0    10    13    16
1    11    14    17
2    12    15    18

In [19]:
frame_test2 = pd.DataFrame([[10, 11, 12], [13, 14, 15], [16, 17, 18]])
frame_test2 = frame_test2.transpose()
frame_test2.columns = [1999, 2000, 2001]
frame_test2

   1999  2000  2001
0    10    13    16
1    11    14    17
2    12    15    18